cases/flameletSimpleSMOKE/Sandia_COH2N2.oldOF/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 0 0 0 1 0 0 0 ];

internalField   uniform 290;

boundaryField
{
    inletfuel           
    {
        type  		fixedValue;
 	value 		uniform 292;
    }

    inletair           
    {
        type  		fixedValue;
 	value 		uniform 290;
    }

    outlet          
    {
        type  		zeroGradient;
    }

    sidewall       
    {
        type  		zeroGradient;
    }

    burnerwall
    {
        type  		zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
