cases/flameletSimpleSMOKE/Sandia_COH2N2.oldOF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0.05;
        smoother        GaussSeidel;
        cacheAgglomeration off;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
        solver          PBiCG;
	preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
    }

    "(k|epsilon|H|Z|Zvar)"
    {
        $U;
        tolerance       1e-09;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.5;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 1.5;

    pMin	    pMin   [1 -1 -2 0 0 0 0] 1e4;


    residualControl
    {
        p               1e-5;
        U               1e-6;
        H               1e-6;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p               0.1;
        rho             0.5;
    }
    equations
    {
        U               0.2;
        "(k|epsilon)"   0.3;
	Z		0.3;
	Zvar		0.1;
	H		0.3;
    }
}


// ************************************************************************* //
